/*********************************************************************************************************************
* RT1064DVL6A Opensourec Library 即（RT1064DVL6A 开源库）是一个基于官方 SDK 接口的第三方开源库
* Copyright (c) 2022 SEEKFREE 逐飞科技
* 
* 本文件是 RT1064DVL6A 开源库的一部分
* 
* RT1064DVL6A 开源库 是免费软件
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
* 
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 
* 您应该在收到本开源库的同时收到一份 GPL 的副本
* 如果没有，请参阅<https://www.gnu.org/licenses/>
* 
* 额外注明：
* 本开源库使用 GPL3.0 开源许可证协议 以上许可申明为译文版本
* 许可申明英文版在 libraries/doc 文件夹下的 GPL3_permission_statement.txt 文件中
* 许可证副本在 libraries 文件夹下 即该文件夹下的 LICENSE 文件
* 欢迎各位使用并传播本程序 但修改内容时必须保留逐飞科技的版权声明（即本声明）
* 
* 文件名称          main
* 公司名称          成都逐飞科技有限公司
* 版本信息          查看 libraries/doc 文件夹内 version 文件 版本说明
* 开发环境          IAR 8.32.4 or MDK 5.33
* 适用平台          RT1064DVL6A
* 店铺链接          https://seekfree.taobao.com/
* 
* 修改记录
* 日期              作者                备注
* 2022-09-21        SeekFree            first version
********************************************************************************************************************/

#include "zf_common_headfile.h"

// 打开新的工程或者工程移动了位置务必执行以下操作
// 第一步 关闭上面所有打开的文件
// 第二步 project->clean  等待下方进度条走完

//********注意事项********
//1.勤擦赛道 勤擦轮胎勤擦赛道 勤擦轮胎勤擦赛道 勤擦轮胎！！！这对车模状态稳定十分重要
//2.在烧写程序时记得关闭主板总电源开关
//3.摄像头的高度和角度都是定死的 不要用手触碰摄像头 拿车也不要提着摄像头杆拿
//4.速度设置要量力而行 轨迹完全稳定再考虑提速 初期2m/s左右即可
//5.发车时注意其他同学和车子的位置 不要发生撞车 要保护好车模
//6.速度提升的关键 模糊PD 速度规划 元素识别 差速控制
//7.发车前先将车浮空看电机转速是否正常 确认无疯转再落地跑车
//8.该程序已经可以支持低速下的循迹 斑马线识别 环岛识别 参数调节与速度的提升则是同学们需要努力的地方
//9.电池电量低会导致状态不佳 电池满电为12.6伏 少于11.1伏则需要充电了
//10.调车是要多花时间多琢磨的过程 祝大家校内赛赛出真实水平 学到真东西
//成功的路上并不拥挤，因为坚持的人不多！！！

  




int main(void)
{
    clock_init(SYSTEM_CLOCK_600M);  // 不可删除
    // 此处编写用户代码 例如外设初始化代码等
    system_delay_ms(500);
    oled_init();//屏幕初始化
    mt9v03x_init();//摄像头初始化
    /*
    刘沐：
    摄像头曝光时间设置，大家可以根据实际图像亮度来更改曝光时间
    但一般不需要进行更改，除非你的二值化图像真的很烂，而且无法
    通过调整软件阈值参数来修正时才需要更改
    */
    mt9v03x_set_exposure_time(370);
    Servo_PWM_Init();//舵机初始化
    Motor_PWM_Init();//电机初始化
    Encoder_Init();//编码器初始化
    /*
    刘沐：
    上面这些初始化所有的引脚我们都是配置好的
    不熟悉代码框架的情况下，不要随便更改这些初始化(除了曝光时间)
    下面这句是中断初始化，大家可以根据需要来自行设置中断周期来使用中断
    也可以自行添加多个中断
    */
    pit_ms_init(PIT_CH0, 2);//定时器中断初始化
    system_delay_ms(500);
    interrupt_global_enable(0);
    // 此处编写用户代码 例如外设初始化代码等
    
    while(1)
    {
        // 此处编写用户代码
        if(mt9v03x_finish_flag) //摄像头采集完成标志位
        {
            mt9v03x_finish_flag = 0; //清零摄像头标志位
            //二值化计算
            Binary_Img();
            //屏幕显示二值化图像
            OLED_Print_Img128X64(videoData);
            //算截止行
            Find_EndRow();
            //记录真实截止行
            RealEndRow=EndRow;
            //修正截止行
            CorrectEndRow();
            //找边界
            FindBorder();
            //算中线
            Find_MidLine();
            //找控制行
            FindControlRow();
            Get_Direction_Error();
            
            Direction_Control_Error();
            Speed_Correct();
        }
        // 此处编写用户代码
    }
}



